

curl -fsS -X POST 'http:/localhost:5433/query' -H 'Content-Type: application/json' --data '{"query: "idor"}'                                                                         


NONE RETURNED!

expected_ 4f29e617-3513-4c7e-bd79-7606f9203cf4
expected_ no others
[
  {
    "kind": "trend",
    "external_id": "e2547616-7f9f-44ed-aab1-9204c5da713b",
    "follow_up_sources": [
      "https://www.draytek.com/about/security-advisory/buffer-overflow-vulnerabilities-(cve-2024-51138-cve-2024-51139)"
    ],
    "summary": "The discovery of multiple vulnerabilities in Draytek Vigor routers, including arbitrary code execution and buffer overflow (CVE-2024-41334, CVE-2024-41339, CVE-2024-51138), highlights the critical security issues facing network infrastructure devices. These vulnerabilities enable attackers to execute unauthorized commands and compromise network integrity. The impact is significant for businesses relying on these routers for secure communications. The industry must focus on routine security audits, timely firmware updates, and advanced intrusion detection systems to mitigate these threats effectively.",
    "score": 0.3640652000904083
  },
  {
    "kind": "directive",
    "external_id": "1088a55d-e4b0-49a8-8ab3-c674ed3f5c75",
    "follow_up_sources": [
      "https://www.bleepingcomputer.com/news/security/counterfeit-android-devices-found-preloaded-with-triada-malware/",
      "https://www.pcmag.com/news/counterfeit-android-phones-preloaded-with-a-special-surprise-malware",
      "https://securityaffairs.com/176143/malware/new-triada-comes-preinstalled-on-android-devices.html"
    ],
    "summary": "Counterfeit Android phones have been discovered with Triada malware pre-installed, affecting over 2,600 devices. This highlights the risks associated with purchasing devices from unofficial sources and the importance of sourcing phones from reputable vendors to avoid malware infections.",
    "score": 0.2507155239582062
  },
  {
    "kind": "trend",
    "external_id": "8d4887f3-6d3b-4001-a17e-45efc0c7002b",
    "follow_up_sources": [
      "https://cyberscoop.com/microsoft-patch-tuesday-april-2025/"
    ],
    "summary": "An alarming trend has been observed in the cybersecurity landscape with multiple vulnerabilities being actively exploited despite recent patches. Microsoft's latest security update addresses a flaw exploited in ransomware campaigns, yet threat actors continue to target domain controllers and exploit NTLM vulnerabilities in Windows systems. Meanwhile, a separate malvertising campaign using Node.js is targeting crypto users. These patterns indicate an increasing sophistication in attack methods and the need for continuous vigilance and proactive patch management to protect digital assets.",
    "score": 0.2411491721868515
  }
]

REVIEWED
curl -v -X POST http://localhost:8000/query \
  -H "Content-Type: application/json" \
  -d '{"query":"CSRF","top_k":3}'


expected_ d285fc1d-70e5-4959-829e-32dfa3601bc6
expected_ fd331198-3993-401c-9d01-f9c2d4eea9aa

expect_ 5269f672-2877-41ce-9731-dc1ec0cfd774
[
    {
      "kind": "trend",
      "external_id": "941c1bd3-22b4-4f0d-88eb-4a97e2f56ece",
      "follow_up_sources": [
        "https://cyberpress.org/mautic-vulnerability-websites/"
      ],
      "summary": "Recent vulnerabilities in popular platforms highlight a troubling trend of exploitable security flaws. Mautic users face risks from remote code execution and file deletion vulnerabilities, threatening the integrity of systems relying on this marketing automation software. Similarly, Emlog Pro v2.5.3 is exposed to arbitrary file uploads, enabling attackers to execute malicious code. These security gaps emphasize the need for robust vulnerability management and patch application strategies across industries heavily reliant on these technologies, including marketing and content management systems.",
      "score": 0.43451017141342163
    },
    {
      "kind": "trend",
      "external_id": "4227ed61-0548-45ca-aa2b-006403dd6f06",
      "follow_up_sources": [
        "https://www.forbes.com/sites/daveywinder/2025/02/22/new-fbi-warning-backup-today-as-dangerous-attacks-ongoing/"
      ],
      "summary": "Ransomware attacks are increasingly targeting organizations globally, with the UK experiencing a significant surge. These attacks, often facilitated through the Dark Web, indicate a growing industrialization of ransomware, requiring organizations to adopt modern tools and agile workflows in their security operations. The threat is compounded by sophisticated threat actors, including China-backed groups, executing rapid system compromises.",
      "score": 0.34839770197868347
    },
    {
      "kind": "directive",
      "external_id": "0ced13d4-6db9-4a8f-a011-19af3f09c6d6",
      "follow_up_sources": [
        "https://www.securityweek.com/chinese-botnet-powered-by-130000-devices-targets-microsoft-365-accounts/"
      ],
      "summary": "Cybercriminals are exploiting Microsoft 365 accounts using password-spray attacks targeting Basic Auth. Organizations should enforce multi-factor authentication and disable Basic Auth to protect against these threats and ensure account security.",
      "score": 0.3468264937400818
    }
  ]



  curl -v -X POST http://localhost:8000/query \
  -H "Content-Type: application/json" \
  -d '{"query":"OS command injection","top_k":3}

  expected_ 4a8c6f2a-504e-455c-9ad5-0b83c8a7b6ee
expeted_ be46fd59-ac22-4edd-8886-bcaa2d77db94
expected_ d28f34ca-2dbc-448f-bb39-cd10700c7bc4
[
  {
    "kind": "trend",
    "external_id": "534e6529-feb0-41e4-bd57-d64a5f091d45",
    "follow_up_sources": [
      "https://www.okoone.com/spark/technology-innovation/why-gmail-still-isnt-safe-for-sensitive-business-communication/"
    ],
    "summary": "Recent discussions highlight that Gmail's encryption methods may not suffice for protecting sensitive enterprise communications. Experts stress the need for additional security measures beyond standard encryption, particularly for organizations handling highly confidential data. This indicates potential vulnerabilities in relying solely on traditional email encryption, urging businesses to adopt comprehensive data protection strategies that integrate advanced encryption technologies and additional layers of security.",
    "score": 0.6089187860488892
  },
  {
    "kind": "trend",
    "external_id": "5650d0cc-781f-4bb1-83d2-2d523abff946",
    "follow_up_sources": [
      "https://www.csoonline.com/article/3822338/authorities-seize-phobos-and-8base-ransomware-servers-arrest-4-suspects.html"
    ],
    "summary": "The takedown of the 8Base ransomware gang by international law enforcement agencies highlights the importance of cross-border collaboration in combating cybercrime. Despite the decline in ransom payments, ransomware threats continue to evolve, requiring ongoing vigilance.",
    "score": 0.5638931393623352
  },
  {
    "kind": "directive",
    "external_id": "4b41458a-01f7-4746-8de4-21a6b80b79d0",
    "follow_up_sources": [
      "https://www.darkreading.com/threat-intelligence/cybercrime-cobalt-strike-use-plummets-worldwide"
    ],
    "summary": "Collaborative efforts by Fortra, Microsoft, and Health-ISAC have led to an 80% global decline in unauthorized Cobalt Strike usage. Despite this success, organizations are urged to remain vigilant and continue updating security tools and sharing threat intelligence.",
    "score": 0.5314504504203796
  }
]




  curl -v -X POST http://localhost:8000/query \
  -H "Content-Type: application/json" \
  -d '{"query":"code injection","top_k":3}'

  expected_ c574d96b-d1bd-48d1-8e33-15007fced0e4
  expected_ 5447850b-9099-4ded-9182-dddcee2639d8


  expected f3525039-d03e-4311-8dbe-986d598c5136
  expected_ 0ffe75ae-7eb8-44ed-b3be-dc7b6b5d3ce0
  expected_ fd331198-3993-401c-9d01-f9c2d4eea9aa
  expected_ 2769ad3b-f483-43a5-96aa-ed0bcc874e59
  expected_ 04654e83-f101-4f22-a0e8-f9cacd8fca5e
    -> no labels for this
    [
        {
          "kind": "trend",
          "external_id": "5447850b-9099-4ded-9182-dddcee2639d8",
          "follow_up_sources": [
            "https://nvd.nist.gov/vuln/detail/CVE-2025-26900"
          ],
          "summary": "The Flexmls® IDX plugin for WordPress has been found vulnerable to Object Injection via Deserialization, marked by CVE-2025-26900. This vulnerability underscores an emerging pattern of deserialization issues in widely-used WordPress plugins, posing a significant threat to web application security. Object Injection vulnerabilities can allow attackers to execute arbitrary code, leading to potential data tampering or server compromise. This highlights the need for developers and IT professionals to implement stricter validation and serialization methods. Businesses relying on these plugins must prioritize auditing their code for such vulnerabilities to safeguard against exploitation.",
          "score": 0.5449015498161316
        },
        {
          "kind": "trend",
          "external_id": "85d4d1a9-aab0-4337-90a7-a0ac6ecb60cb",
          "follow_up_sources": [
            "https://www.infosecurity-magazine.com/news/disa-global-solutions-confirms/"
          ],
          "summary": "DISA Global Solutions has disclosed a significant data breach affecting 3.3 million individuals, exposing sensitive personal data such as social security numbers and financial accounts. This incident underscores the critical vulnerabilities present in data handling processes of employee screening services. The breach highlights the necessity for enhanced data protection measures and rigorous security audits to safeguard personal information against unauthorized access.",
          "score": 0.5184389352798462
        },
        {
          "kind": "trend",
          "external_id": "235feb7d-13e7-479c-8052-eeae3f81721c",
          "follow_up_sources": [
            "https://www.cvedetails.com/cve/CVE-2024-55532/"
          ],
          "summary": "The improper neutralization vulnerability in Apache Ranger, identified as CVE-2024-55532, underscores a critical challenge in application security. This flaw allows malicious actors to exploit formula elements, potentially leading to unauthorized access and data manipulation. Organizations relying on Apache Ranger must urgently address these security gaps to prevent exploitation. This emphasizes the necessity for developers to adopt secure coding practices and stringent code reviews to detect and rectify vulnerabilities early in the development lifecycle.",
          "score": 0.516922116279602
        }
      ]


  curl -v -X POST http://localhost:8000/query \
  -H "Content-Type: application/json" \
  -d '{"query":"File upload","top_k":3}'

  [
    {
      "kind": "trend",
      "external_id": "549c7a30-ff3b-4665-8055-50375210f756",
      "follow_up_sources": [
        "https://www.darkreading.com/mobile-security/zerodium-ups-ante-for-zero-day-exploits-especially-in-ios"
      ],
      "summary": "The sudden disappearance of Zerodium, a major exploit reseller, has sent ripples through the cybersecurity landscape. This development raises significant concerns regarding the availability and distribution of zero-day exploits. Previously active in seeking vulnerabilities, particularly in platforms like Telegram, Zerodium's absence could lead to a vacuum in the exploit market or a shift of zero-day vulnerabilities to less scrupulous actors. This impacts software vendors, security researchers, and organizations reliant on vulnerability information to secure their systems.",
      "score": 0.4618203043937683
    },
    {
      "kind": "trend",
      "external_id": "33a1f5f5-6fde-4fc8-95d5-4e7374b84e33",
      "follow_up_sources": [
        "https://www.cisa.gov/news-events/bulletins/sb25-083"
      ],
      "summary": "Recent discoveries of multiple unauthorized access vulnerabilities in Forvia Hella HELLA Driving Recorder DR 820, ROADCAM X3 devices, and risks associated with the IROAD Dashcam V due to an unregistered public domain name indicate a troubling pattern in the automotive technology sector. These vulnerabilities, identified through several CVEs, exemplify an emerging threat to consumer privacy and vehicle security. As these devices are increasingly integrated into personal and commercial vehicles, the implications for data security and unauthorized access become significant. Manufacturers and users of such technologies are urged to prioritize regular security audits and updates to mitigate these risks.",
      "score": 0.4550281763076782
    },
    {
      "kind": "trend",
      "external_id": "9299c549-8813-4d60-8a54-e39beb3d2338",
      "follow_up_sources": [
        "https://www.infosecurity-magazine.com/news/ransomware-payments-decline/"
      ],
      "summary": "Ransomware payments have decreased by 35% in 2024 due to law enforcement crackdowns and improved victim defenses. This trend suggests a shift in the ransomware landscape, with attackers potentially adopting new tactics, such as exfiltrate-and-pay models, requiring organizations to adapt their security strategies.",
      "score": 0.32718029618263245
    }
  ]

  curl -v -X POST http://localhost:8000/query \
  -H "Content-Type: application/json" \
  -d '{"query":"Hardcoded credentials","top_k":3}'

  expected_ 12dd303c-7af4-4a1c-addb-fc6a9f6c7016

    expected_ 73fceeb3-5661-4487-a8eb-379001f2eaff
    expected_ c3551cf3-3a48-46ee-bf82-855188db5b0b
  expected_ 0bcb53de-1b26-4009-90e7-e06fdcdb9d44
  [
    {
      "kind": "trend",
      "external_id": "c2fd36c0-70bc-4226-9239-cf1be8462482",
      "follow_up_sources": [
        "https://cybersrcc.com/2025/03/20/fake-captcha-pdfs-spread-lumma-stealer-via-webflow-godaddy-and-other-domains-a-deep-dive-into-the-campaign/"
      ],
      "summary": "A sophisticated phishing campaign has been identified, spreading the Lumma Stealer malware using fake CAPTCHA PDFs hosted on platforms like Webflow and GoDaddy. This signifies an evolution in phishing tactics, where attackers leverage trusted domains to bypass email filters and deceive users. The widespread use of Webflow and GoDaddy increases the potential reach of these attacks, impacting both individual users and businesses. Organizations should enhance email security protocols and conduct awareness training to mitigate these threats.",
      "score": 0.4647220969200134
    },
    {
      "kind": "trend",
      "external_id": "2591b4b4-9b5d-45d2-9d29-c4e6c80f09a0",
      "follow_up_sources": [
        "https://www.youtube.com/watch?v=Z4Bzr3Ii2E0"
      ],
      "summary": "The 'Secure by Design' initiative is showing signs of progress in reducing software vulnerabilities. Security experts like Chris Wysopal and Jason Healey have noted improvements, though questions remain regarding the speed of implementation. This suggests a growing industry acknowledgment of integrating security measures during the software development phase, potentially reducing future vulnerabilities and improving overall cybersecurity posture.",
      "score": 0.43611371517181396
    },
    {
      "kind": "trend",
      "external_id": "7c40f22c-5848-4591-ada4-97fe297177d4",
      "follow_up_sources": [
        "https://www.dataguidance.com/news/uk-ncsc-publishes-guidance-privileged-access"
      ],
      "summary": "The UK National Cyber Security Centre has released security principles aimed at mitigating malicious domain registrations and securing privileged access workstations. These directives are designed to help organizations bolster their defenses against cyber threats by establishing robust security frameworks and access controls. The implications of these principles are far-reaching, as they set a precedent for global cybersecurity standards, influencing organizations across various industries to adopt similar practices.",
      "score": 0.4014514684677124
    }
  ]




  curl -v -X POST http://localhost:8000/query \
  -H "Content-Type: application/json" \
  -d '{"query":"session mishandling","top_k":3}'

  SESSION MISHANDLING = SESSION timeout
  change session mishandling to -> session fixation according to OWASP

  expected_ e428508f-6306-4242-9bc2-44d4ddddc0b
  returned 2 times the same trend!!!!
  expected_ no other
  [
    {
      "kind": "trend",
      "external_id": "e8a939e6-39df-414a-bb08-68d91ebe2d58",
      "follow_up_sources": [
        "https://security.paloaltonetworks.com/CVE-2024-5917"
      ],
      "summary": "Recent disclosures of vulnerabilities in Unifiedtransform and Elestio highlight persistent issues with access control and server-side request forgery (SSRF) that affect various software systems. The presence of CVE-2024-53573 and CVE-2025-22952 underscores the ongoing threat to data integrity and security. These vulnerabilities necessitate immediate attention from developers and IT security teams to patch affected systems and review security protocols to safeguard against unauthorized access and data breaches.",
      "score": 0.5472291111946106
    },
    {
      "kind": "trend",
      "external_id": "67d14f80-823d-4887-8c49-0e812b2547ec",
      "follow_up_sources": [
        "https://www.blancco.com/resources/blog-the-california-delete-act-a-guide-for-data-brokers-buyers/"
      ],
      "summary": "The enforcement of the Delete Act by the California Privacy Protection Agency represents a significant shift in regulatory oversight for data brokers. The shutdown of Background Alert, Inc. for non-compliance signals a new era of stringent data privacy regulations. This is indicative of a broader movement towards greater accountability and transparency among data brokers, affecting how personal data is collected, stored, and used, potentially impacting numerous businesses reliant on data brokerage services.",
      "score": 0.5470317602157593
    },
    {
      "kind": "directive",
      "external_id": "5d9c7e19-21cd-42d2-9e45-fee999dad170",
      "follow_up_sources": [
        "https://www.bleepingcomputer.com/news/security/cisa-extends-funding-to-ensure-no-lapse-in-critical-cve-services/"
      ],
      "summary": "The U.S. government has temporarily extended MITRE's contract for the CVE program following a sector-wide panic due to potential funding cuts. This program is crucial for tracking vulnerabilities across the industry. Organizations should stay informed about the funding status and prepare for possible shifts in financial support, potentially contributing resources to maintain this vital security initiative.",
      "score": 0.4131055474281311
    }
  ]